clear;
clc;
n=5;
D=2;
a=2*eye(n);
a(1:n-1,2:n)=a(1:n-1,2:n)-eye(n-1);
a(2:n,1:n-1)=a(2:n,1:n-1)-eye(n-1);
disp(a);
v=[2 2 2 2 2 ];
disp(v');

for i=1:n
    for j=max(i-D+1,1):min(i+D-1,n)
        s=a.*v;
    end
end
disp(s);
%κατα στηλες θα ειχα το ακολουθο for i:n
%for j=j=max(i-D+1,1):min(i+D-1,n)
%Α(i,j)=rand;
b=2*eye(n);
disp(b);
d=3;
%πινακας 5*5 βγαζω την κυρια διαγωνια και στο πανω μερος αφαιρω τον
%μοναδιαιο πινακα για να βαλω μηδενικα και κανω το ιδιο για τον κατω 
b(1:n-1,2:n)=b(1:n-1,2:n)-eye(n-1); %n-1 γιατι εχω τωρα 4*4
% απο την 2η στηλη στην 5 
b(1:n-2,3:n)=b(1:n-2,3:n)-eye(n-2);%n-2 γιατι εχω τωρα 3*3
%απο την 3η στηλη ως την 5η
b(2:n,1:n-1)=b(2:n,1:n-1)-eye(n-1);%n-1 γιατι εχω τωρα 4*4
b(3:n,1:n-2)=b(3:n,1:n-2)-eye(n-2);%n-2 γιατι εχω τωρα 3*3
disp(b);
for i=1:n
    for j=max(i-d+1,1):min(i+d-1,n)
        k=b.*v;
    end
end
disp(k);

%αν ειχα εναν αναμοικτο πινκα με d1 και d2 με d1=2 και d2=3
% θα ειχα το d1 στο min και το d2 στο max
m=3;
C=rand(n,m);
y=zeros(n,m);
for g=1:m
for i=1:n
    for j=max(i-D+1,1):min(i+D-1,n)
    y(i,g)=y(i,g)+a(i,j)*C(j,g);
    end
end 
end 
disp(y);
% γινομενο πινακα α με τον πινακα C



