clear;
clc;
%a=12;
%b=5;
%t=linspace(0,10*pi,1000);
%x=(a+b)*cos(t)-b*cos((a/b+1)*t);
%y=(a+b)*sin(t)-b*sin((a/b+1)*t);
%plot(x,y);


%x=linspace(0,pi,300);
%y=linspace(0,pi,300);
%[x,y]=meshgrid(x,y);
%z=y+sin(x.^3+y.^3);
%mesh(z);
%contour(z); %οσο πιο κοκκινο το χρωμα τοσο πιο χαμηλες 

%x=1790:10:1950;
%y=3929*(1.256.^(0:16))*1000;
%p=197273000./(1+exp(-0.03134*(x-1913.25)));
%plot(x,y,'o');
%hold
%plot(x,p,'--');

%n=1:1000;
%r=sqrt(n);
%d=137.51;
%theta=pi*d*n/180;
%plot(r.*cos(theta),r.*sin(theta),'o');
%ή χρηση polar(theta,ρ,'ο');

%int32('α'):αυτη η εντολη θα μου δωσει το νουμερο στο οποιο αντιστοιχει το
%α

s1='abadf';
s2='aabdf';
%προβλημα που ελεγχεις αν τα string ειναι ιδια , παω σε καθε στοιχειο
%καιφτιαχνω δυο πινακες f1,f2 με μηδενικα καθε
%φορα που βρισκω το γραμμα αυξανω το νουμερο του πινακα κατα 1 στην αντιστοιχη θεση 
% το α αντιστοιχει στο νουμερο 95 θα μπορουσα να
%γραψω τον ιδιο κωδικα να αυξανω κατα 1 τα νουμερα του πινακα f1 και να
%αφαιρω 1 τα νουμρα του f2 και στο τελος να προσθεσω με εντολη sum τα f1,f2
%αν το αποτελεσμα ειναι μηδεν τοτε ειναι ισα
f1=zeros(1,26);
f2=zeros(1,26);
for i=1:length(s1)
     f1(int32(s1(i))-97+1)=f1(int32(s1(i))-97+1)+1;
end
for i=length(s2)
    f2(int32(s2(i))-97+1)=f2(int32(s2(i))-97+1)+1;
end
all(f1==f2);







