clear;
clc;
N=100;
A=1:N;
disp(sum(A(A<=100))); % αθροισμα στοιχειων μεχρι το 100
disp(sum(A(mod(A,2)==0))); % αθροισμα αρτιων αριθμων 
disp(sum(A(mod(A,2)==1))); %αθροισμα περιττων αριθμων
%χ=25 ,reshape(x,5,5) αυτη η εντολη θα παρει το 25 και θα επιστρεψει εναν
%πινακα 5*5
c=[200,500,700,1000,1500];
cost=5*ones(1,length(c));
cost=cost+10*(c>500 & c<=1000) +35*(c>1000);
cost=cost+ 0.02*c.*(c<=500);
cost=cost+ (0.05*(c-500)).*(c>500 & c<=1000);
cost=cost+(0.1*(c-1000)).*(c>1000);
disp(cost);

